# Kategorik Değişken Kırılımında Değer Atama

### Bir şirketteki bir personelin maaş alanı eksik olsun. Bu eksik veriyi doldurmak için tüm şirketin maaş ortalamasını bulup onu atamak çok yanlış olur. Ancak departmanın maaş ortalamasını atarsak daha yakın bir değer elde edebiliriz. Kategorik değişkenlere göre atama yapmak bu demektir.

In [1]:
import numpy as np
import pandas as pd
V1 = np.array([1,3,6,np.NaN,7,1,np.NaN,9,15])
V2 = np.array([7,np.NaN,5,8,12,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,12,5,6,14,7,np.NaN,2,31])
V4 = np.array(["IT","IT","IK","IK","IK","IK","IK","IT","IT"])

df = pd.DataFrame(
        {"maas" : V1,
         "V2" : V2,
         "V3" : V3,
        "departman" : V4}        
)

df

   maas    V2    V3 departman
0   1.0   7.0   NaN        IT
1   3.0   NaN  12.0        IT
2   6.0   5.0   5.0        IK
3   NaN   8.0   6.0        IK
4   7.0  12.0  14.0        IK
5   1.0   NaN   7.0        IK
6   NaN   NaN   NaN        IK
7   9.0   2.0   2.0        IT
8  15.0   3.0  31.0        IT

In [12]:
df.groupby("departman")["maas"].describe() # sütun halinde gösterilemez çünkü grupladıktan sonra her satıra birden fazla veri düşüyor.

           count      mean       std  min  25%  50%   75%   max
departman
IK           3.0  4.666667  3.214550  1.0  3.5  6.0   6.5   7.0
IT           4.0  7.000000  6.324555  1.0  2.5  6.0  10.5  15.0

In [2]:
df.groupby("departman")["maas"].mean()

departman
IK    4.666667
IT    7.000000
Name: maas, dtype: float64

In [11]:
df.maas

0     1.0
1     3.0
2     6.0
3     NaN
4     7.0
5     1.0
6     NaN
7     9.0
8    15.0
Name: maas, dtype: float64

In [14]:
df.maas.fillna(df.groupby("departman")["maas"].transform("mean"))

0     1.000000
1     3.000000
2     6.000000
3     4.666667
4     7.000000
5     1.000000
6     4.666667
7     9.000000
8    15.000000
Name: maas, dtype: float64